# Data Manipulation Revision

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Dataframes

In [13]:
df = pd.DataFrame([['Hi','Hello'],['one','two']],columns=[1,2])
df

     1      2
0   Hi  Hello
1  one    two

In [8]:
df[1]

0     Hi
1    one
Name: 1, dtype: object

In [11]:
df[1].iloc[1]

'one'

In [16]:
df.shape

(2, 2)

# CSV File

In [35]:
data = pd.read_csv('fishes.csv')
data.head()

,Family,Scientific name,English name,Swedish name,Habitat,Occurrence,Red List Status
0,Paralepididae (Barracudina),Arctozenus risso,NaN,Mindre laxtobis,Marine,Sporadic,Not evaluated
1,Paralepididae,Magnisudis atlantica,NaN,Laxtobis,Marine,Sporadic,Not evaluated
2,Acipenseridae,Acipenser baerii,Sturgeon,Sibirisk stör,brackish water,Introduced; not established,Not evaluated
3,Acipenseridae,Acipenser gueldenstaedti,NaN,Rysk stör,brackish water,Introduced; not established,Not evaluated
4,Acipenseridae,Acipenser ruthenus,NaN,Sterlett,"Fresh water, brackish water","Introduced, not established",Not evaluated

In [57]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 121 entries, 2 to 251
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Family           121 non-null    object
 1   Scientific name  121 non-null    object
 2   English name     121 non-null    object
 3   Swedish name     121 non-null    object
 4   Habitat          121 non-null    object
 5   Occurrence       121 non-null    object
 6   Red List Status  121 non-null    object
dtypes: object(7)
memory usage: 11.6+ KB

In [68]:
data.describe(include='all')

,Family,Scientific name,English name,Swedish name,Habitat,Occurrence,Red List Status
count,121,121,121,121,121,121,121
unique,55,121,121,121,9,7,12
top,Cyprinidae,Acipenser baerii,Sturgeon,Sibirisk stör,Marine,Native and common,Not evaluated
freq,18,1,1,1,63,79,79

In [36]:
data.isnull()

,Family,Scientific name,English name,Swedish name,Habitat,Occurrence,Red List Status
0,False,False,True,False,False,False,False
1,False,False,True,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,True,False,False,False,False
4,False,False,True,False,False,False,False
...,...,...,...,...,...,...,...
247,False,False,False,True,False,False,False
248,False,False,True,True,False,False,False
249,False,False,True,True,False,False,False
250,False,False,False,True,False,False,False
251,False,False,False,False,False,False,False

In [37]:
data.isna().sum()

Family               0
Scientific name      0
English name       114
Swedish name        53
Habitat              0
Occurrence           0
Red List Status      1
dtype: int64

In [40]:
data['Family'].shape

(252,)

In [41]:
data = data.dropna()

In [42]:
data.isna().sum()

Family             0
Scientific name    0
English name       0
Swedish name       0
Habitat            0
Occurrence         0
Red List Status    0
dtype: int64

In [46]:
data['Family'].shape

(121,)

In [43]:
data.columns

Index(['Family', 'Scientific name', 'English name', 'Swedish name', 'Habitat',
       'Occurrence', 'Red List Status'],
      dtype='object')

In [44]:
data['Family']

2      Acipenseridae
6      Acipenseridae
7        Anguillidae
8          Congridae
9      Nemichthyidae
           ...
241       Salmonidae
242       Salmonidae
243       Salmonidae
246        Siluridae
251           Zeidae
Name: Family, Length: 121, dtype: object

In [45]:
print(type(data['Family']))

# So we could understand Dataframe is a combination of series

<class 'pandas.core.series.Series'>

In [56]:
data.iloc[0]

Family                           Acipenseridae
Scientific name               Acipenser baerii
English name                          Sturgeon
Swedish name                     Sibirisk stör
Habitat                         brackish water
Occurrence         Introduced; not established
Red List Status                  Not evaluated
Name: 2, dtype: object